app/views/polls/show.html.erb

  <%= form_with(model: [@poll, @poll_response]) do |form| %>
    <% @poll.restaurants.each do |restaurant|%>
---
SELECT "restaurants".* FROM "restaurants" INNER JOIN "restaurant_polls" ON "restaurants"."id" = "restaurant_polls"."restaurant_id" WHERE "restaurant_polls"."poll_id" = $1  [["poll_id", 1]]