app/controllers/application_controller.rb

  def after_sign_in_path_for(resource_or_scope)
    if current_user.admin?
      new_poll_path
    else
      Poll.last
---
SELECT  "polls".* FROM "polls" ORDER BY "polls"."id" DESC LIMIT $1  [["LIMIT", 1]]