app/controllers/polls_controller.rb

SELECT "polls".* FROM "polls"
---
  def index
    @polls = Poll.all

SELECT  "polls".* FROM "polls" ORDER BY "polls"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  1 AS one FROM "poll_responses" WHERE "poll_responses"."user_id" = $1 AND "poll_responses"."poll_id" = $2 LIMIT $3  [["user_id", 1], ["poll_id", 1], ["LIMIT", 1]]
---
  def show
    @poll = Poll.last
    if PollResponse.where(user: current_user, poll: @poll).exists?

INSERT INTO "polls" ("date", "user_id", "created_at", "updated_at", "end_time") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2018-11-19"], ["user_id", 9], ["created_at", "2018-11-19 16:15:30.447950"], ["updated_at", "2018-11-19 16:15:30.447950"], ["end_time", "2018-11-19 16:17:00.448318"]]
INSERT INTO "restaurant_polls" ("poll_id", "created_at", "updated_at", "restaurant_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["poll_id", 1], ["created_at", "2018-11-19 16:15:30.540334"], ["updated_at", "2018-11-19 16:15:30.540334"], ["restaurant_id", 1]]
SELECT  "restaurant_polls".* FROM "restaurant_polls" WHERE "restaurant_polls"."poll_id" = $1 AND "restaurant_polls"."restaurant_id" = $2 LIMIT $3  [["poll_id", 1], ["restaurant_id", 1], ["LIMIT", 1]]
---
  def create
    @poll = current_user.polls.create(date: Date.today)
    poll_params[:restaurant_id].each do |restaurant_id|
      @poll.restaurant_polls.find_or_create_by(restaurant_id: restaurant_id)

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_poll
      @poll = Poll.find(params[:id])