app/controllers/poll_responses_controller.rb

INSERT INTO "poll_responses" ("user_id", "restaurant_id", "poll_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["restaurant_id", 1], ["poll_id", 1], ["created_at", "2018-11-15 21:03:11.349389"], ["updated_at", "2018-11-15 21:03:11.349389"]]
---
  def create
    @poll_response = @poll.poll_responses.new(poll_response_params)
    @poll_response.user = current_user
    if @poll_response.save

SELECT "restaurants".* FROM "restaurants" INNER JOIN "restaurant_polls" ON "restaurants"."id" = "restaurant_polls"."restaurant_id" WHERE "restaurant_polls"."poll_id" = $1  [["poll_id", 1]]
SELECT "poll_responses".* FROM "poll_responses" WHERE "poll_responses"."poll_id" = $1  [["poll_id", 1]]
---
  def index
    respond_to do |format|
      format.html do
        @restaurants = @poll.restaurants
        @order = Order.new
      end

      @results  = PollResponse.where(poll: @poll).group_by do |response|

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_poll
    @poll = Poll.find(params[:poll_id])