app/models/poll.rb

  def winner
    if closed? && poll_responses.any?
      poll_responses
        .group_by{ |pr| pr.restaurant }
        .transform_values{ |v| v.count }
        .max_by{|restaurant, vote_count| vote_count }
        .first
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]