app/models/restaurant.rb

SELECT COUNT(*) FROM "poll_responses" WHERE "poll_responses"."poll_id" = $1 AND "poll_responses"."restaurant_id" = $2  [["poll_id", 1], ["restaurant_id", 1]]
---
  def votes_in(poll)
    poll.poll_responses.where(restaurant_id: id).count